app/views/xml_views/MultihitRequest.xml.erb

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
<s:Header>
<wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken wsu:Id="SecurityToken-ad2b9f33-eba3-4e0f-ae41-e90379b97f56" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:Username><%=username %></wsse:Username>
<wsse:Password><%=password %></wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</s:Header>
<s:Body>
<Query xmlns="http://creditinfo.com/schemas/2012/09/MultiConnector">
<request xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
<MessageId><%= messageid %></MessageId>
<RequestXml>
<RequestXml xmlns="http://creditinfo.com/schemas/2012/09/MultiConnector/Messages/Request">
<connector id="22636b5b-067f-48ae-86f6-cf6a900b7408">
<data id="${=java.util.UUID.randomUUID()}">
<request xmlns="http://creditinfo.com/schemas/2012/09/MultiConnector/Connectors/Bee/Request"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xsi:schemaLocation="http://creditinfo.com/schemas/2012/09/MultiConnector/Connectors/Bee/Request file:/C:/Users/d.felix/Desktop/Smart%20Search/Smart%20Search/TZA_NMB_BeeRequest.xsd">
<DecisionWorkflow>NMB.TZA.Base</DecisionWorkflow>
<RequestData>
<Individual>	
<IdNumbers>
<IdNumberPairIndividual>
<IdNumber><%= idnumber%></IdNumber>
<IdNumberType><%= idnumbertype %></IdNumberType>
</IdNumberPairIndividual>
</IdNumbers>
<InquiryReasons>ApplicationForCreditOrAmendmentOfCreditTerms</InquiryReasons>
<CreditInfoId></CreditInfoId>
<TypeOfReport>CreditinfoReportPlus</TypeOfReport>
</Individual> 
</RequestData>
</request>
</data>
</connector>
</RequestXml>
</RequestXml>
<Timeout i:nil="true"/>
</request>
</Query>
</s:Body>
</s:Envelope>